# 1 задача:

   

#  Напишите программу, которая симулирует игру лото с одной картой. Начните с генерирования списка их всех возможных номеров выпадения (от В1 до О75). После этого перемешайте номера в хаотичном порядке, воспользовавщись функцией  из модуля random. Вытаскивайте по одному номеру из списка и зачеркивайте номера, пока карточка не окажется выигравшей. Приведите 1000 симуляций и выведите на экран минимальное, максимальное и среднее количество извлечений номеров, требующееся для выигрыша.
