"""
Задания по командной строке linux
"""
"""
1) Какая комбинация клавиш используется для открытия терминала в Linux?
"""
# control + alt + t

"""
2) Перейдите в свою домашнюю директорию
"""
# Вариант один = cd Вариант два = cd ~ Вариант три = cd /Users на Mac Os


# писать код здесь
"""
3) Создайте папку под названием codify
"""
# mkdir codify


# писать код здесь
"""
4) Создайте внутри папки codify 3 папки c названиями: week1, week2, week3
"""
# mkdir week1, week2, week3

# писать код здесь
"""
5) Перейдите в папку week1 и создайте файл test.txt (одной командой)
"""
# cd week1//// touch test.txt

# писать код здесь
"""
6) Напишите внутри файла test.txt предложение Hello world!
"""

# nano test.txt '''''' print('hello world!')


# писать код здесь
"""
7) Выведите содержимое файла test.txt на стандартное устройство вывода.
"""
# cat test.txt


# писать код здесь
"""
😍 Перейдите в домашнюю папку.
"""
# cd ~

# писать код здесь
"""
9) Перейдите в папку week1 находясь в домашней папке.
"""
# cd Desktop/bootCamp/codify/week1
"""""
10) Создайте внутри папки week1 три файла под названием test1.txt, test2.txt, test3.txt
"""
# KurmanbekovAlihan@MacBook-Air week1 % touch test1.txt test2.txt test3.txt 

"""
11) Скопируйте содержимое файла test.txt и скопируйте в файл под названием test1.txt
"""
# KurmanbekovAlihan@MacBook-Air week1 % cp test.txt test1.txt


# писать код здесь
"""
12) Удалите файл test1.txt
"""

# KurmanbekovAlihan@MacBook-Air week1 % rm  test1.txt

# писать код здесь
"""
13) Переместите файл test.txt в папку week2
"""
# KurmanbekovAlihan@MacBook-Air codify % mv week1/test.txt week2



# писать код здесь
"""
14) Удалите папку week1 с содержимым
"""
# KurmanbekovAlihan@MacBook-Air codify % rm -rf week1

# писать код здесь
"""
15) Перейдите в домашнюю папку по абсолютному пути (не используя ~)
"""
# KurmanbekovAlihan@MacBook-Air codify % cd

# писать код здесь
"""
16) Введите команду, чтобы узнать путь до текущей директории
"""
# KurmanbekovAlihan@MacBook-Air ~ % pwd


